// DepartmentKeywords.js
export const departmentKeywords = {
  일반내과: ["내과", "일반내과", "건강검진", "종합검진"],
  호흡기내과: ["호흡기", "폐렴", "천식", "기관지염", "COPD", "결핵"],
  순환기내과: ["순환기", "심장", "혈압", "부정맥", "협심증", "심부전"],
  소화기내과: [
    "소화기",
    "위염",
    "위궤양",
    "역류성 식도염",
    "대장염",
    "간염",
    "지방간",
  ],
  혈액종양내과: ["혈액", "종양", "백혈병", "림프종", "빈혈", "항암"],
  내분비대사내과: ["내분비", "당뇨", "갑상선", "고지혈증", "비만", "골다공증"],
  알레르기내과: [
    "알레르기",
    "아토피",
    "비염",
    "두드러기",
    "음식 알레르기",
    "꽃가루",
  ],
  신장내과: ["신장", "콩팥", "단백뇨", "혈뇨", "신부전", "투석"],
  감염내과: ["감염", "전염병", "독감", "코로나", "HIV", "간염", "성병"],
  류마티스내과: ["관절염", "무릎"],
};
